'''დაწერეთ პითნის ფუნქცია, რომელიც იღებს პარამეტრად ერთი დაიგივე
ზომის სიას (list) და zip ფუნქციის გამოყენებით დააჯგუფეთ სიების ელემენტები.'''

list1 = [1, 2, 3]
list2 = ['a', 'b', 'c'] 

print(*zip(list1, list2))


'''დაწერეთ პითონის ფუნქცია, რომელიც პარამეტრად იღებს რიცხვების სიას და
აბრუნებს ელემენტების ნამრავლს. ფუნქციაში გაითვალისწინეთ გამონაკლისები (Exceptions),
თუ მიიღეთ არასწორი ტიპის პარამეტრს (TypeError).
ფუქნციის დასაწერად გამოიყენეთ lambda და functools-ის reduce მეთოდი.'''

from functools import reduce

list1 = [1, 2, 3, 4, 5, 'c']

sum_of_list = reduce(lambda x, y: x*y if type(x) == int and type(y) == int else 'TypeError', list1)
print(sum_of_list)



'''დაწერეთ lambda ფუნქცია რომელიც
იღებს მთელი რიცხვების სიას (list) და აბრუნებს მხოლოდ სიის კენტ ელემენტებს.'''

list1 = [1, 2, 3, 4, 5, 6, 7]
odds = filter(lambda x: x % 2 ==1, list1)

print(list(odds))

'''დაწერეთ პითნის ფუნქცია, რომელიც იღებს ორ პარამეტრს, სტრიქონების სიასა და სტრიქონს (ending).
დააბრუნეთ მხოლოდ სიის ის ელემენტები რომელიც მთავრდება, მეორე პარამეტრად მიწოდებული სტრიქონით.
გამოიყენეთ lambda და filter ფუნქცია. გაითვალისწინეთ გამონაკლისები (TypeError), თუ სხვა
გამონაკლისიცაღმოჩნდა ისიც გაითვალისწინეთ. მინიშნება: გადაავლეთ თვალი string მეთოდებს,
მონახეთ ისეთი მეთოდი, რომელიც აბრუნებს სიტყვას, რომელიც მთავრდება რაღაც სიმბოლოებით...'''


list1 = ['hello', 'world', 'coding', 'nod']
text = 'Coding'
ending ='ing'

func = filter(lambda x: x.endswith(ending), list1)
print(list(func))


